In [1]:
import pandas as pd

In [2]:
user = pd.read_json("cleaned_user.json")

In [3]:
minhash = pd.read_csv("minhash.csv", header=None)

In [4]:
minhash.columns = ['A', 'B', 'val']

In [5]:
user_id = 42

In [6]:
minhash[(minhash.A == user_id) | (minhash.B == user_id)]

              A        B       val
19235        42   652908  0.666667
28532   3309187       42  0.666667
82000        42  4440571  0.666667
124674       42  4960503  0.666667
305652  4042753       42  0.666667
462715       42   447988  0.666667

In [7]:
reviews = pd.read_csv("./user_review_bus.csv", sep='\t')

In [8]:
reviews['bus_num'] = reviews['bus_new'].apply(lambda x: len(x.split(", ")))

In [9]:
minhash.merge(reviews, left_on='A', right_on='id').sort_values(by='bus_num', ascending=False)

,A,B,val,Unnamed: 0,id,bus_new,bus_num
460454,4476724,5495693,0.686038,54397,4476724,"53114, 24140, 83325, 59285, 83541, 23618, 8724...",523
457966,3140689,3188575,0.551351,38111,3140689,"51756, 25188, 2144, 75993, 83325, 84896, 73417...",303
463492,2679600,863635,0.584746,32556,2679600,"73530, 52902, 64619, 94720, 11019, 73822, 9413...",288
458172,2245415,3089462,0.609375,27322,2245415,"78593, 73417, 26679, 54898, 62761, 87091, 5306...",172
433762,5347520,685007,0.689320,64897,5347520,"95743, 420, 94151, 84972, 90892, 52029, 86895,...",135
...,...,...,...,...,...,...,...
44005,2778825,3675483,0.666667,33788,2778825,62431,1
44006,2778825,3793502,0.500000,33788,2778825,62431,1
44007,2778825,903612,0.666667,33788,2778825,62431,1
44008,2778825,4551612,0.666667,33788,2778825,62431,1
267922,1349591,5442995,0.666667,16446,1349591,62342,1

In [10]:
minhash[(minhash.A == user_id) | (minhash.B == user_id)]

              A        B       val
19235        42   652908  0.666667
28532   3309187       42  0.666667
82000        42  4440571  0.666667
124674       42  4960503  0.666667
305652  4042753       42  0.666667
462715       42   447988  0.666667

In [11]:
user_id = 4476724
row_id = 60061

In [12]:
len(user[user.id == user_id].friend_id.values[0])

327

In [13]:
user[user.id == 5495693]

,Unnamed: 0,average_stars,compliment_cool,compliment_cute,compliment_funny,compliment_hot,compliment_list,compliment_more,compliment_note,compliment_photos,...,cool,elite,fans,funny,name,review_count,useful,yelping_since,id,friend_id
9065,9065,3.58,194,5,194,73,5,15,267,126,...,3757,"2011,2012,2013,2014,2015,2016,2017,2018",142,3175,Mark,1646,5685,2011-06-05 16:36:02,5495693,"[4376577, 378891, 1869841, 3627026, 4608030, 3..."

In [14]:
len(user[user.id == 5495693].friend_id.values[0])

465

In [15]:
len(user[user.id == user_id].friend_id.values[0])

327

In [16]:
user[user.id == user_id]

,Unnamed: 0,average_stars,compliment_cool,compliment_cute,compliment_funny,compliment_hot,compliment_list,compliment_more,compliment_note,compliment_photos,...,cool,elite,fans,funny,name,review_count,useful,yelping_since,id,friend_id
11730,11730,3.5,103,5,103,101,2,7,100,62,...,1271,"2013,2014,2015,2016,2017",53,1184,Gigi,659,1567,2012-06-12 21:27:11,4476724,"[213003, 378891, 4679696, 3512352, 864292, 303..."

In [18]:
users =  [29163, 49996, 57876]
print(user.iloc[users])

       Unnamed: 0  average_stars  compliment_cool  compliment_cute  \
29163       29163           3.83              432               14
49996       49996           4.03              109                3
57876       57876           3.78             1464               20

       compliment_funny  compliment_hot  compliment_list  compliment_more  \
29163               432             366                2               50
49996               109              45                1               13
57876              1464             530                2               55

       compliment_note  compliment_photos  ...  cool                elite  \
29163              138                101  ...  3936                 None
49996               45                  7  ...  3966  2010,2011,2012,2013
57876              430                440  ...  9178                 2021

       fans  funny  name  review_count  useful        yelping_since       id  \
29163    47   3652  Nick           236    4233  2010-04-07 04:51:10  5236527
49996    42   3903   Tim           440    4321  2010-03-06 06:02:28  2568097
57876    66   4671   Sue           692   10282  2015-11-04 04:50:17  4978186

                                               friend_id
29163  [5376003, 1206280, 2000907, 5322763, 5300235, ...
49996  [1359873, 2932740, 2439172, 5038087, 5357577, ...
57876  [1001473, 3244037, 1292293, 5142538, 3192842, ...

[3 rows x 23 columns]

In [21]:
4978186 in user[user.id == user_id].friend_id.values[0]

False